Output from Terraform plan
```[command]/home/runner/work/_temp/f652d446-08b4-4acf-8866-b9336ef93e16/terraform-bin plan -refresh=false -no-color -out=plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/start-vms"
      ~ log_verbose             = true -> false
        name                    = "start-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "lsast"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "lsast"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "nomis-bip-lsast-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "nomis-bip-lsast"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "nomis-bip-lsast"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "nomis-bip-lsast-automation-account"
      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "nomis-bip-lsast"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "nomis-bip-lsast-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/start-vms"
      ~ log_verbose             = true -> false
        name                    = "start-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "preprod"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "preprod"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "nomis-bip-preprod-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "nomis-bip-preprod"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "nomis-bip-preprod"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "nomis-bip-preprod-automation-account"
      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "nomis-bip-preprod"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "nomis-bip-preprod-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

Plan: 8 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "lsast"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "lsast"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-lsast-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-lsast"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-lsast"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-lsast-automation-account"%0A      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-lsast"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-lsast-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "preprod"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "preprod"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-preprod-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-preprod"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-preprod"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-preprod-automation-account"%0A      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-preprod"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-preprod-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0APlan: 8 to add, 4 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "lsast"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "lsast"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-lsast-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-lsast"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-lsast"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-lsast-automation-account"%0A      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-lsast"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-lsast-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "preprod"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "preprod"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-preprod-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-preprod"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-preprod"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-preprod-automation-account"%0A      + target_resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-preprod"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-preprod-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0APlan: 8 to add, 4 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::set-output name=stderr::
::set-output name=exitcode::0
```